<a href="https://colab.research.google.com/github/vjbarayuga/Week2-Pandas-for-Data-Manipulation-CodingDojo/blob/main/TitanicDatasetAnalysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
# 1 Display the head of the dataframe
import pandas as pd
# Keep in mind that the filename will likely be different on your computer (especially later in course)
filename='/content/drive/MyDrive/Coding_DOJO-Data_Science_Bootcamp/02_Part_Time_Data_Science/2_Pandas_for_Data_Manipulation/Dataset/titanic.csv'
df = pd.read_csv(filename)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [5]:
df.Name.describe()

count                 891
unique                891
top       Calic, Mr. Jovo
freq                    1
Name: Name, dtype: object

In [6]:
df.sort_values('Name')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
845          846         0       3  ...   7.5500   NaN         S
746          747         0       3  ...  20.2500   NaN         S
279          280         1       3  ...  20.2500   NaN         S
308          309         0       2  ...  24.0000   NaN         C
874          875         1       2  ...  24.0000   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
286          287         1       3  ...   9.5000   NaN         S
282          283         0       3  ...   9.5000   NaN         S
361          362         0       2  ...  27.7208   NaN         C
153          154         0       3  ...  14.5000   NaN         S
868          869         0       3  ...   9.5000   NaN         S

[891 rows x 12 columns]

In [7]:
# drop useless columns
df.drop('Name', axis=1, inplace=True)
df.drop('Cabin', axis=1, inplace=True)
df.drop('Ticket', axis=1, inplace=True)

# no need for the following as the sum is used
df.drop('Parch', axis=1, inplace=True)
df.drop('SibSp', axis=1, inplace=True)

In [8]:
df

     PassengerId  Survived  Pclass     Sex   Age     Fare Embarked
0              1         0       3    male  22.0   7.2500        S
1              2         1       1  female  38.0  71.2833        C
2              3         1       3  female  26.0   7.9250        S
3              4         1       1  female  35.0  53.1000        S
4              5         0       3    male  35.0   8.0500        S
..           ...       ...     ...     ...   ...      ...      ...
886          887         0       2    male  27.0  13.0000        S
887          888         1       1  female  19.0  30.0000        S
888          889         0       3  female   NaN  23.4500        S
889          890         1       1    male  26.0  30.0000        C
890          891         0       3    male  32.0   7.7500        Q

[891 rows x 7 columns]

In [9]:
# 2 Percentage of people who survived
df['Survived'].mean()

0.3838383838383838

In [10]:
# 3 How many of each sex survived
df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [11]:
# 4 Group of passengers who paid less than $10
df["Fare"] < 10
df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
Fare            32.204208
dtype: float64

In [12]:
# 5 Did not survive
did_not_survived_data = df[df['Survived'] == 0]
did_not_survive = did_not_survived_data.count().values[1]
did_not_survive
#did_not_survive_percent = (did_not_survive/891) * 100
#print('The percentage of who did not survive in the data are {}'.format(survival_percent))

549

In [13]:
# 5 Average age not survived
age_not_survived = did_not_survived_data.groupby(by=['Age'])[['Survived']].count().mean()
age_not_survived

Survived    5.506494
dtype: float64

In [14]:
# 6 Survived
survived_data = df[df['Survived'] == 1]
survived = survived_data.count().values[1]
survived
#survival_percent = (survived/891) * 100
#print('The percentage of who survived in the data are {}'.format(survival_percent))

342

In [15]:
# 6 Average age survived
age_survived = survived_data.groupby(by=['Age'])[['Survived']].count().mean()
age_survived

Survived    4.461538
dtype: float64

In [17]:
# 7 Average age of those who did and did not survive grouped by sex

age_survived = survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  28.847716
male    27.276022

In [18]:
# 7 Average age of those who did and did not survive grouped by sex

age_survived = did_not_survived_data.groupby(by=['Sex'])[['Age']].mean()
age_survived

              Age
Sex
female  25.046875
male    31.618056

In [19]:

#PRACTICE CODE
#Overall average age of those who survived and did not survive
#df_new = df['Survived']
#df_new = df.loc[df_new, :]
#df_new = df['Survived'].value_counts(dropna = False)
#df_new
df_new = df['Survived']
df_new = df.loc[df_new, :]
survived = df['Survived'].value_counts(dropna = False)
survived

0    549
1    342
Name: Survived, dtype: int64

In [15]:
#PRACTICE CODE
#Overall average age of those who survived
#Overall average age of those who did not survive
#survived = df[df['Survived'] == 1]
#died = df[df['Survived'] == 0]
#print('Analysis of Survival')
#print('{0} survived the wreck'.format(survived.shape[0]))
#print('{0} did not survive the wreck'.format(died.shape[0]))
#survived_percent = round(((float(len(survived)/len(df))) * 100), 2)
#died_percent = round(((float(len(died)/len(df))) * 100), 2)
#print('Survival Percentage = {0} %'.format(survived_percent))
#print('Death Percentage = {0} %'.format(died_percent))

In [16]:
#PRACTICE CODE
#df[["Sex", "Age"]].groupby("Sex").mean()

In [17]:
#df[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

In [18]:
#PRACTICE CODE
#df[["Sex", "Age","Survived"]].groupby("Sex").mean()

In [19]:
#PRACTICE CODE
#df.groupby('Sex').agg({'Age':'mean'})